00_simpleFoam_k_epsilon_example/0/V
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
155679
(
3.12017e-09
3.87885e-09
3.91991e-09
3.81645e-09
2.83423e-09
1.10944e-09
4.17431e-09
3.86517e-08
...
)
;

boundaryField
{
    WALL
    {
        type            calculated;
        value           uniform 0;
    }
    TOP
    {
        type            symmetry;
    }
    BOTTOM
    {
        type            calculated;
        value           uniform 0;
    }
    STIRRER
    {
        type            calculated;
        value           uniform 0;
    }
    HOLDER
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
