00_simpleFoam_k_epsilon_example/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          smoothSolver;
        tolerance       1e-10;
        relTol          0.3;
        smoother        symGaussSeidel;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    }

    k
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    }

    epsilon
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-07;
        relTol          0;
    }
}

SIMPLE
{
    nCorrectors 		5;
    nNonOrthogonalCorrectors 	5;
    pRefCell        		0;
    pRefValue       		0;
}

relaxationFactors
{
    fields
    {
        p               0.8; // war 0.15
    }
    equations
    {
        U               0.3025; // war 0.3
        k               0.3025; // war 0.3
        epsilon         0.3025; // war 0.3
    }
}


// ************************************************************************* //
